name: "shadowgen_segmenter"
platform: "onnxruntime_onnx"
max_batch_size: 4
input [
  {
    name: "image"
    data_type: TYPE_FP32
    dims: [ 3, -1, -1 ]
  }
]
output [
  {
    name: "mask"
    data_type: TYPE_FP32
    dims: [ 1, -1, -1 ]
  }
]
dynamic_batching {
  preferred_batch_size: [ 2, 4 ]
  max_queue_delay_microseconds: 15000
}
instance_group [
  {
    kind: KIND_GPU
    count: 1
  }
]
